buoyantPimpleFoam_timevaryingBC/boussinesq_salome_HeatExchg/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

./salome-mesh-gen


runApplication $(getApplication)

#------------------------------------------------------------------------------
